jmeter_tests/aggregatereport200.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
http://127.0.0.1:8000/login/,700,16,7,39,75,126,1,137,51.86%,3.22006,7.59,1.95
http://127.0.0.1:8000/,700,17042,3787,65053,75621,83159,75,87036,31.00%,2.4304,181.63,1.29
http://127.0.0.1:8000/cart/,350,10092,364,41397,56609,61620,74,62686,25.43%,1.22551,57.89,0.66
http://127.0.0.1:8000/checkout/,350,1553,179,504,639,53248,3,67103,3.43%,1.22517,15.55,0.7
http://127.0.0.1:8000/save-shipping-address/,350,406,210,685,863,1446,8,16290,4.29%,1.2245,6.67,1.11
Test,350,46168,70477,84835,85841,86786,704,87835,100.00%,1.0383,227.97,4.45
TOTAL,2800,11542,293,61657,77651,85434,1,87835,37.36%,8.30641,455.94,8.9