jmeter_tests/aggregatereport500.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
http://127.0.0.1:8000/login/,1112,25,2,74,125,381,0,442,91.37%,4.13153,10.59,0.77
http://127.0.0.1:8000/,1112,9947,6,44817,77844,86156,0,91926,70.32%,3.22647,125.68,0.74
http://127.0.0.1:8000/cart/,556,11404,8,49153,65378,71259,0,71787,73.92%,1.62379,70.73,0.41
http://127.0.0.1:8000/checkout/,556,1238,6,983,3008,45629,0,71440,50.36%,1.61023,12,0.44
http://127.0.0.1:8000/save-shipping-address/,556,2899,91,4137,15921,60665,0,62628,55.22%,1.61064,19.13,0.78
Test,556,35489,1768,87958,92163,94344,4,94961,100.00%,1.40289,204.72,2.58
TOTAL,4448,8872,8,44258,79521,89924,0,94961,75.36%,11.22308,409.44,5.15