jmeter_tests/aggregatereport70.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
http://127.0.0.1:8000/login/,1452,21,3,58,112,368,0,442,81.680%,2.18498,5.49,0.63
http://127.0.0.1:8000/,1452,7920,360,28260,65638,83929,0,91926,53.857%,2.23023,69.41,0.67
http://127.0.0.1:8000/cart/,726,8803,168,44401,61153,71208,0,71787,56.612%,1.11847,38.35,0.36
http://127.0.0.1:8000/checkout/,726,993,108,567,2598,36257,0,71440,38.567%,1.11800,7.87,0.39
http://127.0.0.1:8000/save-shipping-address/,726,2279,163,3097,12148,60650,0,62628,42.287%,1.11786,11.21,0.65
Test,726,27959,2609,87031,90262,94211,4,94961,100.000%,1.03629,122.92,2.51
TOTAL,5808,6989,42,14972,70240,88318,0,94961,63.567%,8.29031,245.83,5.02